### ANS 1

In [1]:
data=[['application_number'],
      [4],
      [8],
      [15],
      [16],
      [23],
      [42]
     ]

In [18]:
import pandas as pd 
import csv

In [3]:
f=open('data.csv','w')

In [4]:
with open('data.csv','w') as f:
    writer=csv.writer(f)
    
    for i in data:
        writer.writerow(i)

In [5]:
f.close()

In [6]:
df=pd.read_csv('data.csv')

In [7]:
df.columns

Index(['application_number'], dtype='object')

In [8]:
df['application_number']

0     4
1     8
2    15
3    16
4    23
5    42
Name: application_number, dtype: int64

### ANS 2

In [9]:
l=[0,1,2,3,4,5,6,7,8,9]
my_series=pd.Series(l)
print(my_series)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

### ANS 3

In [10]:
data_1=[["Name","Age","Gender"],
       
        ['Allice',25,'Female'],
        ["bob",30,'male'],
        ['claire',27,'female']
        
        
       ]

In [11]:
with open('data_1.csv','w') as f:
    writer=csv.writer(f)
    
    for i in data_1:
        writer.writerow(i)

In [13]:
pd.read_csv("data_1.csv")

     Name  Age  Gender
0  Allice   25  Female
1     bob   30    male
2  claire   27  female

### ANS 4 
dataframe in pandas is the representation of 2-d rows and coloumn it is the representation of multiple rows and coloumn, while series the reprenstation of only one rows it is used to represent only one row.
### for example

In [14]:
pf1=pd.read_csv("data_1.csv")

In [15]:
pf1['Name']

0    Allice
1       bob
2    claire
Name: Name, dtype: object

In [16]:
pf1[["Name","Age"]]

     Name  Age
0  Allice   25
1     bob   30
2  claire   27

### ANS 5
some of the function which help us in the manupluation of data is:
1) tail=it is used to get some last  element of the data 
2) head=it is used to get some top element of the data 
3) column= it provides us the heading of the coloumn 
4) dtype= it tells us the data type of the coloumns

### ANS 6
mutable objects are those objects which are iterable.data frame is mutable in nature because it allows us to perform many operation like updation,deletion etc

### ANS 7
collection of multiple series is know as dataframe.

In [27]:
name=pd.Series(['aman','shomiya','deepak'])
age=pd.Series([44,43,42])
scores=pd.Series([98,99,97])

data={'Name':name,"Age":age, "Scores":scores}
pd.DataFrame(data)

      Name  Age  Scores
0     aman   44      98
1  shomiya   43      99
2   deepak   42      97